app/views/articles/show.html.erb

<p>Tags:
  <% @article.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = 10