app/controllers/articles_controller.rb

  def create
    @article = Article.new(params[:article])
    @article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", nil], ["created_at", Fri, 29 Mar 2013 19:01:55 UTC +00:00], ["title", "Article Number 5!"], ["updated_at", Fri, 29 Mar 2013 19:01:55 UTC +00:00]]

  def update
    @article = Article.find(params[:id])
    @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "articles" SET "body" = 'Now I have some text because someone edited me. Still not sure why the text I was created with never showed up in the article.', "updated_at" = '2013-03-29 20:01:59.827870' WHERE "articles"."id" = 6