app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])
    @comment.article_id = params[:article_id]

    @comment.save
---
INSERT INTO "comments" ("article_id", "author_name", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["author_name", "Han"], ["body", "Oh be quiet Chewy."], ["created_at", Fri, 29 Mar 2013 23:29:33 UTC +00:00], ["updated_at", Fri, 29 Mar 2013 23:29:33 UTC +00:00]]